-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 19 2022 г., 16:01
-- Версия сервера: 8.0.24
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `car_list`
--

-- --------------------------------------------------------

--
-- Структура таблицы `car`
--

CREATE TABLE `car` (
  `id` int NOT NULL,
  `brand` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `model` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `color` text COLLATE utf8mb4_general_ci NOT NULL,
  `num` int NOT NULL,
  `price` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `car`
--

INSERT INTO `car` (`id`, `brand`, `model`, `color`, `num`, `price`) VALUES
(160, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(161, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(162, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(163, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(164, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(165, 'BMW', 'X1', 'Серый', 3, 2790000),
(166, 'BMW', 'X3', 'Желтый', 4, 4520000),
(167, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(168, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(169, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(170, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(171, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(172, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(173, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(174, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(175, 'BMW', 'X1', 'Серый', 3, 2790000),
(176, 'BMW', 'X3', 'Желтый', 4, 4520000),
(177, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(180, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(181, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(182, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(183, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(184, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(185, 'BMW', 'X1', 'Серый', 3, 2790000),
(186, 'BMW', 'X3', 'Желтый', 4, 4520000),
(187, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(189, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(190, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(191, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(192, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(193, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(194, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(195, 'BMW', 'X1', 'Серый', 3, 2790000),
(196, 'BMW', 'X3', 'Желтый', 4, 4520000),
(197, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(198, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(199, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(200, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(201, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(202, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(203, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(204, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(205, 'BMW', 'X1', 'Серый', 3, 2790000),
(206, 'BMW', 'X3', 'Желтый', 4, 4520000),
(207, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(208, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(209, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(210, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(211, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(212, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(213, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(214, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(215, 'BMW', 'X1', 'Серый', 3, 2790000),
(216, 'BMW', 'X3', 'Желтый', 4, 4520000),
(217, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(218, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(219, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(220, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(221, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(222, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(223, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(224, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(225, 'BMW', 'X1', 'Серый', 3, 2790000),
(226, 'BMW', 'X3', 'Желтый', 4, 4520000),
(227, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(228, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(229, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(230, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(231, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(232, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(233, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(234, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(235, 'BMW', 'X1', 'Серый', 3, 2790000),
(236, 'BMW', 'X3', 'Желтый', 4, 4520000),
(237, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(238, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(239, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(240, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(241, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(242, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(243, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(244, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(245, 'BMW', 'X1', 'Серый', 3, 2790000),
(246, 'BMW', 'X3', 'Желтый', 4, 4520000),
(247, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(248, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(249, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(250, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(251, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(252, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(253, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(254, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(255, 'BMW', 'X1', 'Серый', 3, 2790000),
(256, 'BMW', 'X3', 'Желтый', 4, 4520000),
(257, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(258, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(259, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(260, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(261, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(262, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(263, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(264, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(265, 'BMW', 'X1', 'Серый', 3, 2790000),
(266, 'BMW', 'X3', 'Желтый', 4, 4520000),
(267, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(268, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(269, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(270, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(271, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(272, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(273, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(274, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(276, 'BMW', 'X1', 'Серый', 3, 2790000),
(277, 'BMW', 'X3', 'Желтый', 4, 4520000),
(278, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(279, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(280, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(281, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(282, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(283, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(286, 'BMW', 'X1', 'Серый', 3, 2790000),
(287, 'BMW', 'X3', 'Желтый', 4, 4520000),
(288, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(289, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(290, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(291, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(292, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(293, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(294, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(295, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(296, 'BMW', 'X1', 'Серый', 3, 2790000),
(297, 'BMW', 'X3', 'Желтый', 4, 4520000),
(298, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(299, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(300, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(301, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(302, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(303, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(304, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(305, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(307, 'BMW', 'X1', 'Серый', 3, 2790000),
(308, 'BMW', 'X3', 'Желтый', 4, 4520000),
(309, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(310, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(311, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(312, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(314, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(315, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(316, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(319, 'BMW', 'X1', 'Серый', 3, 2790000),
(320, 'BMW', 'X3', 'Желтый', 4, 4520000),
(321, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(322, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(323, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(324, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(325, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(326, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(327, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(328, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(329, 'BMW', 'X1', 'Серый', 3, 2790000),
(330, 'BMW', 'X3', 'Желтый', 4, 4520000),
(331, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(332, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(333, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(334, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(335, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(336, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(337, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(338, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(340, 'BMW', 'X1', 'Серый', 3, 2790000),
(341, 'BMW', 'X3', 'Желтый', 4, 4520000),
(342, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(343, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(344, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(345, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(346, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(347, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(348, 'BMW', 'X1', 'Серый', 3, 2790000),
(349, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(350, 'BMW', 'X3', 'Желтый', 4, 4520000),
(351, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000),
(352, 'BMW', 'M4', 'Зеленый', 7, 7670000),
(353, 'AUDI', 'A3 Sedan', 'Красный', 1, 2675000),
(354, 'AUDI', 'Q5', 'Черный', 8, 6578500),
(355, 'TOYOTA', 'Camry', 'Белый', 2, 2710000),
(356, 'TOYOTA', 'Land Cruiser Prado', 'Черный', 8, 3237000),
(357, 'ŠKODA', 'Octavia', 'Серый', 3, 1598000),
(358, 'CHEVROLET', 'Trailblazer', 'Желтый', 3, 2024000),
(359, 'PORSCHE', 'Panamera', 'Черный', 5, 8210000);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `car`
--
ALTER TABLE `car`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `car`
--
ALTER TABLE `car`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=360;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
